{"backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "batch_input_shape": [null, 784], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "activation": "sigmoid", "trainable": true, "units": 32, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "units": 32, "activation": "sigmoid", "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "units": 32, "activation": "sigmoid", "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "units": 10, "activation": "softmax", "bias_regularizer": null, "kernel_constraint": null}}], "class_name": "Sequential", "keras_version": "2.0.8"}